Repository: JIHUNJO123/toeic-prep-vocabulary
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: TOEIC Prep Vocabulary
vi: Từ vựng luyện thi TOEIC

# todayWord
source: Today's Word
vi: Lời Chúa hôm nay

source: Learning
vi: Học hỏi

# levelLearning
source: Score Level Learning
vi: Điểm số học tập

source: All Words
vi: Tất cả các từ

# viewAllWords
source: View all vocabulary
vi: Xem tất cả từ vựng

source: Favorites
vi: Mục yêu thích

source: Saved words
vi: Từ đã lưu

source: Flashcard
vi: Thẻ học

source: Card learning
vi: Học thẻ

source: Quiz
vi: Trắc nghiệm

source: Test yourself
vi: Hãy tự kiểm tra bản thân

source: Settings
vi: Cài đặt

source: Language
vi: Ngôn ngữ

source: Display Language
vi: Ngôn ngữ hiển thị

source: Select Language
vi: Chọn ngôn ngữ

source: Display
vi: Trưng bày

source: Dark Mode
vi: Chế độ tối

source: Font Size
vi: Kích thước phông chữ

source: Notifications
vi: Thông báo

source: Daily Reminder
vi: Lời nhắc nhở hàng ngày

# dailyReminderDesc
source: Get reminded to study every day
vi: Nhận lời nhắc nhở học tập mỗi ngày

source: Remove Ads
vi: Xóa quảng cáo

source: Ads Removed
vi: Đã xóa quảng cáo

# thankYou
source: Thank you for your support!
vi: Cảm ơn sự ủng hộ của các bạn!

source: Buy
vi: Mua

source: Restore Purchase
vi: Khôi phục giao dịch mua

source: Restoring...
vi: Đang khôi phục...

# purchaseSuccess
source: Purchase successful!
vi: Giao dịch mua hàng thành công!

source: Loading...
vi: Đang tải...

source: Not available
vi: Không có sẵn

source: Info
vi: Thông tin

source: Version
vi: Phiên bản

source: Disclaimer
vi: Tuyên bố miễn trừ trách nhiệm

# disclaimerText
source: This app is an independent TOEIC preparation tool and is not affiliated with, endorsed by, or approved by ETS (Educational Testing Service).
vi: Ứng dụng này là một công cụ luyện thi TOEIC độc lập và không liên kết, không được chứng thực hoặc phê duyệt bởi ETS (Educational Testing Service).

source: Privacy Policy
vi: Chính sách bảo mật

source: Cannot load words
vi: Không thể tải từ

source: No favorites yet
vi: Chưa có mục yêu thích nào.

# tapHeartToSave
source: Tap the heart icon to save words
vi: Nhấn vào biểu tượng trái tim để lưu từ

source: Added to favorites
vi: Đã thêm vào mục yêu thích

source: Removed from favorites
vi: Đã xóa khỏi mục yêu thích

source: Word Detail
vi: Chi tiết từ

source: Definition
vi: Sự định nghĩa

source: Example
vi: Ví dụ

# beginner
source: Beginner (0-400)
vi: Người mới bắt đầu (0-400)

# beginnerDesc
source: Basic vocabulary - 800 words
vi: Từ vựng cơ bản - 800 từ

# intermediate
source: Intermediate (400-600)
vi: Trình độ trung cấp (400-600)

# intermediateDesc
source: Academic vocabulary - 1,200 words
vi: Từ vựng học thuật - 1.200 từ

# advanced
source: Advanced (600-800)
vi: Nâng cao (600-800)

# advancedDesc
source: Advanced expressions - 1,000 words
vi: Biểu đạt nâng cao - 1.000 từ

# expert
source: Expert (800-990)
vi: Chuyên gia (800-990)

# expertDesc
source: Expert vocabulary - 600 words
vi: Từ vựng chuyên ngành - 600 từ

source: Alphabetical
vi: Theo thứ tự bảng chữ cái

source: Random
vi: Ngẫu nhiên

source: Tap to flip
vi: Chạm để lật

source: Previous
vi: Trước

source: Next
vi: Kế tiếp

source: Question
vi: Câu hỏi

source: Score
vi: Điểm

source: Quiz Complete!
vi: Bài kiểm tra đã hoàn thành!

source: Finish
vi: Hoàn thành

source: Try Again
vi: Thử lại

source: Show Result
vi: Hiển thị kết quả

# wordToMeaning
source: Word → Meaning
vi: Từ → Ý nghĩa

# meaningToWord
source: Meaning → Word
vi: Ý nghĩa → Từ

# excellent
source: Excellent! Perfect score!
vi: Xuất sắc! Điểm tuyệt đối!

# great
source: Great job! Keep it up!
vi: Tuyệt vời! Cứ tiếp tục như vậy nhé!

# good
source: Good effort! Keep practicing!
vi: Cố gắng tốt đấy! Cứ tiếp tục luyện tập nhé!

# keepPracticing
source: Keep practicing! You'll improve!
vi: Hãy tiếp tục luyện tập! Bạn sẽ tiến bộ!

# privacyPolicyContent
source: This app does not collect, store, or share any personal information. Your learning progress and favorites are stored only on your device. No data is transmitted to external servers.
vi: Ứng dụng này không thu thập, lưu trữ hoặc chia sẻ bất kỳ thông tin cá nhân nào. Tiến trình học tập và mục yêu thích của bạn chỉ được lưu trữ trên thiết bị của bạn. Không có dữ liệu nào được truyền đến máy chủ bên ngoài.

# restorePurchaseDesc
source: If you have previously purchased ad removal on another device or after reinstalling the app, tap here to restore your purchase.
vi: Nếu trước đây bạn đã mua gói xóa quảng cáo trên thiết bị khác hoặc sau khi cài đặt lại ứng dụng, hãy nhấn vào đây để khôi phục giao dịch mua của bạn.

source: Restore complete
vi: Khôi phục hoàn tất

# noPurchaseFound
source: No previous purchase found
vi: Không tìm thấy giao dịch mua hàng trước đó.

source: Cancel
vi: Hủy

source: Select Quiz Type
vi: Chọn loại trắc nghiệm

# allWordsQuiz
source: All Words
vi: Tất cả các từ

# favoritesOnlyQuiz
source: Favorites Only
vi: Chỉ mục yêu thích

source: Select by Level
vi: Chọn theo cấp độ

# noFavoritesForQuiz
source: No favorites saved. Add some favorites first!
vi: Chưa có mục yêu thích nào. Hãy thêm mục yêu thích trước!

source: {level} Words
vi: {level} từ

source: Locked Content
vi: Nội dung bị khóa

# watchAdToUnlock
source: Watch a short video to unlock all words until midnight!
vi: Xem video ngắn để mở khóa tất cả từ vựng đến nửa đêm!

source: Watch Ad
vi: Xem quảng cáo

# adNotReady
source: Ad is not ready yet. Please try again.
vi: Quảng cáo chưa sẵn sàng. Vui lòng thử lại.

# unlockedUntilMidnight
source: All words unlocked until midnight!
vi: Tất cả từ vựng đã được mở khóa đến nửa đêm!
